# **File Handling**

In [4]:
import pandas as pd
import numpy as np

In [24]:


# 1. Create the merged dataset directly
df = pd.DataFrame({
    'EmpID': [101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 101, 112],
    'Name': ['Ali', 'Sara', 'Ahmed', 'Zara', 'Usman', 'Hina', 'Bilal', 'Nida', np.nan, 'Omer', 'Ali', 'Tariq'],
    'Dept': ['IT', 'HR', 'IT', 'Finance', 'HR', 'IT', 'HR', 'it', 'Finance', 'Marketing', 'IT', 'Sales'],
    'Age': [22, 29, 24, 31, 26, 23, 28, 30, np.nan, 25, 22, 45],
    'Salary': [45000, 52000, 48000, 60000, 50000, 47000, '55000', '62,000', '58000', np.nan, 45000, '70000'],
    'Experience': [1, 5, 2, 7, 3, 1, 4, 6, 8, 2, 1, 15]
})

## Write CSV

In [28]:
df.to_csv('Data.csv',index=False)

## Read CSV

In [29]:
df=pd.read_csv('D:\\MyEnvironment\\Jupyter-Notebook\\Notebooks\\Dataset\\Data.csv')
df

    EmpID   Name       Dept   Age  Salary  Experience
0     101    Ali         IT  22.0   45000           1
1     102   Sara         HR  29.0   52000           5
2     103  Ahmed         IT  24.0   48000           2
3     104   Zara    Finance  31.0   60000           7
4     105  Usman         HR  26.0   50000           3
5     106   Hina         IT  23.0   47000           1
6     107  Bilal         HR  28.0   55000           4
7     108   Nida         it  30.0  62,000           6
8     109    NaN    Finance   NaN   58000           8
9     110   Omer  Marketing  25.0     NaN           2
10    101    Ali         IT  22.0   45000           1
11    112  Tariq      Sales  45.0   70000          15